package data

import (
	"time"
)

var TestTicker = time.NewTicker(time.Second * 60)

var GameStatus = [14]string{"比赛异常", "未开赛", "上半场", "中场", "下半场", "加时赛", "加时赛(弃用)", "点球决战", "完场", "推迟", "中断", "腰斩", "取消", "待定"}

var FootballTerm = [28]string{"进球", "角球", "黄牌", "红牌", "界外球", "任意球", "球门球", "点球", "换人", "比赛开始", "中场", "结束", "半场比分", "两黄变红", "点球未进", "乌龙球", "伤停补时", "射正", "射偏", "进攻", "危险进攻", "控球率", "加时赛结束", "点球大战结束"}

var GroupNum = [26]string{"A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"}
